Terraform plan for __dev__
<details>
<summary>Plan: 5 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.wallet_events.google_project_iam_member.token_creator_binding[0] will be created
  + resource "google_project_iam_member" "token_creator_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-dev-321910"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.wallet_events.google_pubsub_subscription.push_subscriptions["odoo-wallet-credit-debit-push-subscriptions"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "odoo-wallet-credit-debit-push-subscriptions"
      + project                    = "ebo-dev-321910"
      + topic                      = "wallet-events"

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://bvdeveloper-ebomart-development-qa-3729116.dev.odoo.com/v1/wallet/credit_debit"
        }
    }

  # module.wallet_events.google_pubsub_subscription_iam_member.push_subscription_binding["odoo-wallet-credit-debit-push-subscriptions"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-dev-321910"
      + role         = "roles/pubsub.subscriber"
      + subscription = "odoo-wallet-credit-debit-push-subscriptions"
    }

  # module.wallet_events.google_pubsub_topic.topic[0] will be created
  + resource "google_pubsub_topic" "topic" {
      + id      = (known after apply)
      + name    = "wallet-events"
      + project = "ebo-dev-321910"

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.wallet_events.google_pubsub_topic_iam_member.push_topic_binding["odoo-wallet-credit-debit-push-subscriptions"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-548192617349@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-dev-321910"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-dev-321910/topics/wallet-events"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #445](https://github.com/ebomart/commerce-infrastructure/actions/runs/1879607913)